app/controllers/api/v1/usuarios_controller.rb

SELECT `usuarios`.* FROM `usuarios`
---
  def index
    all_usuarios = Usuario.all

SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = NULL LIMIT 1
---
  def show
    usuario = Usuario.find(params[:id])